const privacyStatement = TermsAndPolicy(
  content: '''
“맵투게더(MapTogether)” 서비스 개인정보 처리방침


공고일자 : 2022년 07월 07일

시행일자 : 2022년 07월 07일


맵투게더(‘maptogether.kr’이하 ‘맵투게더’ 또는 ‘회사’)는 개인정보보호법에 따라 이용자의 개인정보 보호 및 권익을 보호하고 개인정보와 관련한 이용자의 고충을 원활하게 처리할 수 있도록 다음과 같은 처리방침을 두고 있습니다. 회사는 개인정보 처리방침을 개정하는 경우 공지사항(또는 개별공지)을 통하여 공지할 것입니다. 맵투게더의 개인정보취급방침은 다음과 같은 내용을 담고 있습니다.


1. 개인정보의 수집 및 처리 목적

2. 수집하는 개인정보 항목 및 수집 방법

3. 개인정보의 보유 및 이용 기간

4. 개인정보의 취급 위탁

5. 정보주체의 권리, 의무 및 그 행사방법

6. 개인정보 파기절차 및 방법

7. 개인정보의 안전성 확보 조치

8. 회원들이 자신의 개인정보를 지키기 위해 알아야 할 사항

9. 개인정보관리책임자 및 담당자 연락처

10. 개인정보 처리방침 변경 시 고지의 의무



1. 개인정보의 수집 및 처리 목적


맵투게더는 다음의 목적을 위해 개인정보를 수집하고 처리합니다. 처리한 개인정보는 다음의 목적이외의 용도로는 사용되지 않으며, 이용 목적이 변경될 시에는 사전 동의를 구하겠습니다.


가. 회원가입 및 관리

  - 회원 가입의사 확인

  - 회원제 서비스 제공에 따른 본인 식별·인증

  - 회원자격 유지·관리

  - 제한적 본인확인제 시행에 따른 본인확인

  - 서비스 부정이용 방지

  - 만14세 미만 아동 개인정보 수집 시 법정대리인 동의 여부 확인

  - 각종 고지·통지, 고충처리, 분쟁 조정을 위한 기록 보존 등을 목적으로 하는 개인정보


나. 민원사무 처리

  - 민원인의 신원 확인

  - 민원사항 확인

  - 사실조사를 위한 연락·통지

  - 처리결과 통보 등을 목적으로 하는 개인정보


다. 재화 또는 서비스 제공

  - 서비스 제공

  - 콘텐츠 제공

  - 맞춤 서비스 제공

  - 본인인증

  - 연령인증

  - 요금결제·정산 등을 목적으로 하는 개인정보


라. 마케팅 및 광고에의 활용

  - 신규 서비스(제품) 개발 및 맞춤 서비스 제공

  - 이벤트 및 광고성 정보 제공 및 참여기회 제공

  - 인구통계학적 특성에 따른 서비스 제공 및 광고 게재

  - 서비스의 유효성 확인

  - 접속빈도 파악 또는 회원의 서비스 이용에 대한 통계 등을 목적으로 하는 개인정보


2. 수집하는 개인정보 항목 및 수집 방법


가. 수집하는 개인정보의 항목

맵투게더의 개인정보 취급 방침에 동의하는 경우에 이하 개인정보가 수집됩니다.

필수 항목 : 이메일

선택 항목 : 이름


나. 개인정보의 수집 방법 

맵투게더는 다음과 같은 방법으로 개인정보를 수집하고 있습니다.

- 모바일앱

- 협력 회사로부터 공동 제휴 및 협력을 통한 정보 수집

- 생성 정보 수집 툴을 통한 일부 항목 자동 수집


다. 개인정보 보관방법

맵투게더는 아래의 서비스를 이용해, 개인정보를 보관하고 있습니다.

- 회원이 올린 모든 개인 정보는 AWS RDS을 활용하여 대한민국, 서울에 위치한 서버에 저장/처리됩니다.


3. 개인정보의 보유 및 이용 기간


맵투게더는 법령에 따른 개인정보 보유 및 이용기간 또는 정보주체로부터 개인정보를 수집 시에 동의 받은 개인정보 보유, 이용기간 내에서 개인정보를 처리, 보유하고 있습니다. 개인정보의 수집 및 이용목적이 달성된 경우 회원의 개인정보를 지체 없이 파기합니다.

4. 개인정보의 취급 위탁


맵투게더는 동의 없이 귀하의 개인정보를 외부에 위탁처리 하지 않습니다.하지만 서비스 향상 및 안정적인 개인정보 취급을 위해서 귀하의 개인정보를 외부에 위탁하여 처리할 수 있습니다.


가. 개인정보의 처리를 위탁하는 경우에는 미리 그 사실을 귀하에게 고지하겠습니다.

나. 개인정보의 처리를 위탁하는 경우에는 위탁계약 등을 통하여 서비스제공자의 개인정보보호 관련 지시엄수, 개인정보에 관한 비밀유지, 제3자 제공의 금지 및 사고시의 책임부담 등을 명확히 규정하고 당해 계약내용을 서면 또는 전자적으로 보관하겠습니다.

다. 개인정보 처리를 위탁하는 경우에는 개인정보 보호법 제25조에 따라 위탁업무 수행목적 외 개인정보 처리금지, 기술적․관리적 보호조치, 재위탁 제한, 수탁자에 대한 관리․감독, 손해배상 등 책임에 관한 사항을 계약서 등 문서에 명시하고, 수탁자가 개인정보를 안전하게 처리하는지를 감독하겠습니다.

라. 위탁업무의 내용이나 수탁자가 변경될 경우에는 지체 없이 본 개인정보 취급방침을 통하여 공개하도록 하겠습니다.


5. 정보주체의 권리, 의무 및 그 행사방법


이용자는 개인정보주체로서 다음과 같은 권리를 행사할 수 있습니다.


가. 정보주체는 회사에 언제든지 다음 각 호의 개인정보 보호 관련 권리를 행사할 수 있습니다.

1. 개인정보 열람요구

2. 오류 등이 있을 경우 정정 요구

3. 삭제요구

4. 처리정지 요구

나. 제1항에 따른 권리 행사는 회사에 대해 개인정보 보호법 시행규칙 별지 제 8호 서식따라 서면, 전자우편, 모사전송(FAX) 등을 통하여 하실 수 있으며 맵투게더는 이에 대해 지체 없이 조치하겠습니다.

다. 정보주체가 개인정보의 오류 등에 대한 정정 또는 삭제를 요구한 경우에는 회사는 정정 또는 삭제를 완료할 때까지 당해 개인정보를 이용하거나 제공하지 않습니다.

라. 제1항에 따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다. 이 경우 개인정보 보호법 시행규칙 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다.


6. 개인정보 파기절차 및 방법

이용자의 개인정보는 원칙적으로 개인정보의 수집 및 이용목적이 달성되면 지체 없이 파기합니다. 회사의 개인정보 파기절차 및 방법은 다음과 같습니다.


가. 파기절차

- 이용자가 회원가입 등을 위해 입력한 정보는 목적이 달성된 후 별도의 DB로 옮겨져(종이의 경우 별도의 잠금장치가 있는 서류보관함) 내부 방침 및 기타 관련 법령에 의한 정보보호 사유에 따라(보유 및 이용기간 참조)일정 기간 저장된 후 파기됩니다.

- 동 개인정보는 법률에 의한 경우가 아니고서는 보유되는 이외의 다른 목적으로 이용되지 않습니다.


나. 파기방법

- 종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기합니다.

- 전자적 파일 형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.


7. 개인정보의 안전성 확보 조치 

맵투게더 이용자들의 개인정보를 취급함에 있어 개인정보가 분실, 도난, 누출, 변조 또는 훼손되지 않도록 안전성 확보를 위하여 노력합니다. 회사는 개인정보보호법 제29조에 따라 다음과 같이 안전성 확보에 필요한 기술적/관리적 및 물리적 조치를 하고 있습니다.

가. 개인정보 취급 직원의 최소화 및 교육

회사의 개인정보관련 취급 직원은 담당자에 한정시키고 있고 이를 위한 별도의 비밀번호를 부여하여 정기적으로 갱신하고 있으며, 담당자에 대한 수시 교육을 통하여 개인정보취급방침의 준수를 항상 강조하고 있습니다.


나. 내부관리계획의 수립 및 시행

개인정보의 안전한 처리를 위하여 내부관리계획을 수립하고 시행하고 있습니다.


다. 해킹 등에 대비한 기술적 대책

맵투게더는 해킹이나 컴퓨터 바이러스 등에 의해 회원의 개인정보가 유출되거나 훼손되는 것을 막기 위해 최선을 다하고 있습니다. 암호화통신 등을 통하여 네트워크상에서 개인정보를 안전하게 전송할 수 있도록 하고 있고, 침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있으며, 기타 시스템적으로 보안성을 확보하기 위한 가능한 모든 기술적 장치를 갖추려 노력하고 있습니다.


라. 개인정보의 암호화

이용자의 개인정보 비밀번호는 암호화 되어 저장 및 관리되고 있어, 본인만이 알 수 있으며 중요한 데이터는 파일 및 전송 데이터를 암호화 하거나 파일 잠금 기능을 사용하는 등의 별도 보안기능을 사용하고 있습니다.

마. 개인정보에 대한 접근 제한

개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여,변경,말소를 통하여 개인정보에 대한 접근통제를 위하여 필요한 조치를 하고 있으며 침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있습니다.


바. 문서보안을 위한 잠금장치 사용

개인정보가 포함된 서류, 보조저장매체 등을 잠금장치가 있는 안전한 장소에 보관하고 있습니다.


사. 비인가자에 대한 출입 통제

개인정보를 보관하고 있는 물리적 보관 장소를 별도로 두고 이에 대해 출입통제 절차를 수립, 운영하고 있습니다.


8. 회원들이 자신의 개인정보를 보호하기 위해 알아야 할 사항

이용자 본인의 부주의나 인터넷상의 문제로 ID, 비밀번호 등 개인정보가 유출되어 발생한 문제에 대해 회사는 책임을 지지 않습니다. 이점 양해 부탁드립니다.


9. 개인정보관리책임자 및 담당자의 연락처 

귀하는 회사의 서비스를 이용하시며 발생하는 모든 개인정보보호 관련 민원을 개인정보관리책임자

혹은 담당부서로 신고하실 수 있습니다. 회사는 이용자들의 신고사항에 대해 신속하게 충분한 답변을 드릴 것입니다.


개인정보 관리책임자

이름: 홍정욱

직위: 대표

전화: +82 10-6331-4287

메일: official.mapto@gmail.com


기타 개인정보침해에 대한 신고나 상담이 필요하신 경우에는 아래 기관에 문의하시기 바랍니다.

- 개인정보침해신고센터 (www.118.or.kr / 118)

- 정보보호마크인증위원회 (www.eprivacy.or.kr / 02-580-0533~4)

- 대검찰청 첨단범죄수사과 (www.spo.go.kr / 02-3480-2000)

- 경찰청 사이버테러대응센터 (www.ctrc.go.kr / 02-392-0330)


10. 개인정보 처리방침 변경 시 고지의 의무

가. 이 개인정보취급방침은 시행일로부터 적용되며, 법령 및 방침에 따른 변경내용의 추가, 삭제 및 정정이 있는 경우에는 변경사항의 시행 14일 전(2주 전)부터 공지사항을 통하여 고지할 것입니다.

 - 공고일자 : 2022년 07월 07일

 - 시행일자 : 2022년 07월 07일
'''
);

const termsOfService = TermsAndPolicy(
  content: '''
“맵투게더(MapTogether)” 서비스 이용약관


본 약관은 여러분이 맵투게더를 이용하는 데 필요한 권리, 의무와 책임사항, 이용조건 및 절차 등 기본적인 사항을 규정하고 있으므로 주의 깊게 읽어주시기 바랍니다.


제1조 목적

맵투게더(이하 ‘맵투게더’ 또는 ‘서비스’)를 이용해 주셔서 감사합니다. 해당 이용약관은 맵투게더(이하 ‘회사’)가 제공하는 나만의 지도에 장소를 추가하고 공유할 수 있는 SNS 서비스 ‘맵투게더’의 회원에 대하여 필요한 제반사항을 규정함을 목적으로 합니다.


제2조 용어의 정의

1. 본 약관에서 사용하는 용어의 정의는 다음과 같습니다.

2. “맵투게더”라 함은 본 서비스의 이름입니다.

3. “콘텐츠”라 함은 “맵투게더”에서 표시되는 또는 “맵투게더”를 통해 제공되는 모든 정보 및 자료를 말합니다. 여기에는 프로그램, 소프트웨어 등이 포함될 수 있습니다.

4. “이용자”라 함은 “맵투게더”를 실행하여 사용하는 사람을 의미합니다.

5. “회원”이라 함은 본 약관에 따라 “맵투게더”에 회원 가입을 한 “이용자”를 의미합니다.

5. 본 조 1항에 정의된 용어 이외에 용어에 대해서는 관계 법령에서 정의하는 바를 따릅니다.


제3조 약관의 효력 및 개정


1. 본 약관의 내용은 서비스의 회원 가입 이전 초기 화면에 게시하거나 기타의 방법으로 공지하고, 본 약관에 동의한 여러분 모두에게 그 효력이 발생합니다.

2. 회사는 필요한 경우 관련법령을 위배하지 않는 범위 내에서 본 약관을 변경할 수 있습니다. 본 약관이 변경되는 경우 회사는 변경 사항을 시행일자 7일 전부터 여러분에게 공지 또는 통지하는 것을 원칙으로 하며, 피치 못하게 여러분에게 불리한 내용으로 변경할 경우에는 그 시행일자 15일 전부터 서비스 내에 등록된 이메일 주소로 이메일을 발송하거나, 알림 메시지를 띄우는 등 합리적으로 가능한 방법으로 변경사항을 공지 또는 통지하겠습니다.

3. 본 약관의 변경 시 공지 또는 통지일로부터 개정약관 시행일 15일 후까지 거부의사를 표시하지 아니하면 승인한 것으로 본다는 뜻을 명확하게 고지하였음에도 여러분의 의사표시가 없는 경우에는 변경된 약관을 승인한 것으로 봅니다. 여러분이 개정약관에 동의하지 않을 경우 여러분은 이용계약을 해지할 수 있습니다.


제4조 개인정보의 보호


회사는 이용자의 서비스 이용에 필요한 최소한의 개인정보를 이용자의 동의를 얻어 수집할 수 있습니다. 해당 개인정보에 대해서는 개인정보 보호 관련 법령이 적용됩니다. 여러분의 개인정보는 서비스의 원활한 제공을 위하여 여러분이 동의한 목적과 범위 내에서만 이용됩니다. 법령에 의하거나 여러분이 별도로 동의하지 아니하는 한 회사가 여러분의 개인정보를 제3자에게 제공하는 일은 결코 없습니다. 기타 회사가 이용자의 개인정보롤 수집 및 보호하고 취급하는 방법은 회사의 “개인정보취급방침”을 참조하시길 바랍니다.


제5조 서비스의 내용


맵투게더는 다음과 같은 서비스를 제공합니다.

  서비스 명 : 맵투게더

  서비스내용

  o 이용자가 나만의 지도에 원하는 장소를 등록하여 사용할 수 있는 장소 노트 기능

  o 이용자들이 등록한 장소를 다른 이용자들과 공유할 수 있는 SNS 기능


제6조 서비스의 이용 변경과 종료


1. 회사는 설비의 점검, 교체, 고장, 통신두절 또는 운영상 상당한 이유가 있는 경우 서비스의 제공을 일시적으로 또는 영구적으로 중단할 수 있습니다.

2. 회사는 본 약관 및 관련 법령 규정을 위반하는 이용자에 대한 서비스 제한 조치를 할 수 있습니다.

3. 본조 제2항에서 정한 사유로 서비스를 중지, 제한, 변경 또는 종료하는 경우, 이용자는 그러한 조치 사실을 안 날로부터 30일 이내에 이의신청을 할 수 있고, 그 이의가 정당하다고 인정하는 경우 회사는 즉시 서비스의 이용을 재개합니다.


제7조 유료서비스의 이용


맵투게더의 서비스는 모두 무료이지만 추후 일부 서비스가 유료로 전환될 수 있습니다. 관련 내용이 추가 또는 변경 될 시 이 조항을 통해 안내드리겠습니다.


제8조 콘텐츠 라이센스


1. “콘텐츠” 및 이에 포함된 모든 자료에 대한 지식재산권, 소유권 및 사용/수익권 등 모든 법적 권리는 회사(또는 회사가 해당 권리를 부여한 자)가 보유합니다. 이용자는 “콘텐츠”에 대하여 서비스 이용을 위한 범위 내에서 개인적, 비독점적이며 양도할 수 없는 제한적인 이용권한 만을 취득하며, 별도 약정이 없는 한 “콘텐츠”에 대한 소유권 기타 처분 권한을 취득하는 것은 아닙니다.

2. 이용자는 회사로부터 별도의 사전 서면 동의를 받거나 회사와 별도 계약을 체결하지 않는 한, “콘텐츠”를 복제, 전송, 배포, 방송 기타 방법으로 이용하거나 제3자에게 용하게 하여서는 안 되고, 이를 상업적인 용도로 사용하거나 타인이 상업적인 목적으로 사용하도록 해서는 안됩니다. 또한 이를 임대 대여, 판매, 양도, 담보로 제공하거나 이전할 수 없습니다.

3. 이용자는 서비스 내에 포함되거나 이에 첨부될 수 있는 “콘텐츠”의 내용 및 그에 대한 소유권, 지식재산권 기타 권리에 관한 표시나 통지내용을 임의로 제거, 모호하게 하거나 변경할 수 없습니다.

4. 서비스 자체에 대한 권리, 소유권 및 지식재산권은 회사가 보유하는 것으로, 이용자는 서비스 이용 시 회사의 모든 성명, 상호, 상표 등 타인의 상품 또는 서비스임을 표시한 표지 및 타인의 영업임을 표시하는 표지 등과 동일 또는 유사한 것을 제작, 사용할 수 없습니다.


제8조 서비스 이용 및 안내


맵투게더의 서비스 이용 및 안내는 추후 제공됩니다. 현재는 서비스 내에 설치된 사용 방법과 문의하기 기능을 통해 담당자에게 직접 물어볼 수 있습니다.


제9조 서비스 이용 주의점


여러분은 서비스를 자유롭게 이용할 수 있으나, 아래와 같이 서비스를 잘못된 방법으로 이용할 수 없다는 점을 잊지 말아주셨으면 합니다. 여러분은 잘못된 방법으로 서비스의 제공을 방해하거나 회사가 안내하는 방법 이외의 다른 방법을 사용하여 서비스에 접근할 수 없습니다.


1. 다른 서비스 이용자의 정보를 무단으로 수집, 이용하거나 다른 사람들에게 제공하는 행위도, 서비스를 영리 목적으로 이용하는 것도, 음란 정보나 저작권 침해 정보 등 공서양속 및 법령에 위반되는 내용의 정보 등을 발송하거나 게시하는 행위도 금지됩니다.

2. 회사의 동의 없이 서비스 또는 이에 포함된 소프트웨어의 일부를 복사, 수정, 배포, 판매, 양도, 대여, 담보제공하거나 타인에게 그 이용을 허락하는 행위와 소프트웨어를 역설계하거나 소스 코드의 추출을 시도하는 등 서비스를 복제, 분해 또는 모방하거나 기타 변형하는 행위도 금지됩니다.

3. 해당 사항에 명시한 내용을 위반한 회원은 서비스 이용을 잠시 또는 계속하여 제한 받을 수 있으며 강제 탈퇴 처리 및 재가입에 제한을 받을 수 있습니다. 또한 피해 발생 시 민형사상의 책임을 지게 됩니다.


제10조 이용계약 해지


1. 여러분이 서비스의 이용을 더 이상 원치 않는 때에는 언제든지 서비스 내 제공되는 메뉴를 이용하여 서비스 이용계약의 해지 신청을 할 수 있으며, 회사는 법령이 정하는 바에 따라 신속히 처리하겠습니다.

2. 이용계약이 해지되면 법령 및 개인정보 취급방침에 따라 여러분의 정보를 보유하는 경우를 제외하고는 여러분의 정보나 여러분이 작성한 게시물 등 모든 데이터는 삭제됩니다.


제10조. 약관의 해석


이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 "전자상거래등에서의소비자보호에관한법률", "약관의규제에관한법률", 기타 관계법령 또는 상관례에 따릅니다.


부칙

① 이 약관은 2022년 07월 07일부터 적용됩니다.

② 2022년 07월 07일부터 시행되던 종전의 약관은 본 약관으로 대체합니다.
'''
);

const termsOfLocationService = TermsAndPolicy(
  content: '''
제 1장. 총 칙 

제 1 조 (목적)

본 약관은 회원(맵투게더 서비스 약관에 동의한 자를 말합니다. 이하 "회원"이라고 합니다)이 맵투게더(이하 "회사"라고 합니다.)가 제공하는 맵투게더 서비스(이하 "서비스"라고 합니다)를 이용함에 있어 회사와 회원의 권리·의무 및 책임사항을 규정함을 목적으로 합니다.

제 2 조 (이용약관의 효력 및 변경)

① 본 약관은 서비스를 신청한 고객 또는 개인위치정보주체가 본 약관에 동의하고 회사가 정한 소정의 절차에 따라 서비스의 이용자로 등록함으로써 효력이 발생합니다.

② 회원이 온라인에서 본 약관의 "동의하기" 버튼을 클릭하였을 경우 본 약관의 내용을 모두 읽고 이를 충분히 이해하였으며, 그 적용에 동의한 것으로 봅니다.

③ 회사는 위치정보의 보호 및 이용 등에 관한 법률, 콘텐츠산업 진흥법, 전자상거래 등에서의 소비자보호에 관한 법률, 소비자 기본법 약관의 규제에 관한 법률 등 관련법령을 위배하지 않는 범위에서 본 약관을 개정할 수 있습니다.

④ 회사가 약관을 개정할 경우에는 기존약관과 개정약관 및 개정약관의 적용일자와 개정사유를 명시하여 현행약관과 함께 그 적용일자 10일 전부터 적용일 이후 상당한 기간 동안 공지만을 하고, 개정 내용이 회원에게 불리한 경우에는 그 적용일자 30일 전부터 적용일 이후 상당한 기간 동안 각각 이를 서비스 홈페이지에 게시하거나 회원에게 전자적 형태(전자우편, SMS 등)로 약관 개정 사실을 발송하여 고지합니다.

⑤ 회사가 전항에 따라 회원에게 통지하면서 공지 또는 공지ㆍ고지일로부터 개정약관 시행일 7일 후까지 거부의사를 표시하지 아니하면 이용약관에 승인한 것으로 봅니다. 회원이 개정약관에 동의하지 않을 경우 회원은 이용계약을 해지할 수 있습니다.

제 3 조 (관계법령의 적용) 본 약관은 신의성실의 원칙에 따라 공정하게 적용하며, 본 약관에 명시되지 아니한 사항에 대하여는 관계법령 또는 상관례에 따릅니다.

제 4 조 (서비스의 내용) 회사가 제공하는 서비스는 아래와 같습니다.

서비스 명 맵투게더

서비스 내용 모바일용 애플리케이션

제 5 조 (서비스 이용요금)

① 회사가 제공하는 서비스는 기본적으로 무료입니다. 단, 별도의 유료 서비스의 경우 해당 서비스에 명시된 요금을 지불하여야 사용 가능합니다.

② 회사는 유료 서비스 이용요금을 회사와 계약한 전자지불업체에서 정한 방법에 의하거나 회사가 정한 청구서에 합산하여 청구할 수 있습니다.

③ 유료서비스 이용을 통하여 결제된 대금에 대한 취소 및 환불은 회사의 결제 이용약관 등 관계법에 따릅니다.

④ 회원의 개인정보도용 및 결제사기로 인한 환불요청 또는 결제자의 개인정보 요구는 법률이 정한 경우 외에는 거절될 수 있습니다.

⑤ 무선 서비스 이용 시 발생하는 데이터 통신료는 별도이며 가입한 각 이동통신사의 정책에 따릅니다.

⑥ MMS 등으로 게시물을 등록할 경우 발생하는 요금은 이동통신사의 정책에 따릅니다.

제 6 조 (서비스내용변경 통지 등)

① 회사가 서비스 내용을 변경하거나 종료하는 경우 회사는 회원의 등록된 전자우편 주소로 이메일을 통하여 서비스 내용의 변경 사항 또는 종료를 통지할 수 있습니다.

② ①항의 경우 불특정 다수인을 상대로 통지를 함에 있어서는 웹사이트 등 기타 회사의 공지사항을 통하여 회원들에게 통지할 수 있습니다.

제 7 조 (서비스이용의 제한 및 중지)

① 회사는 아래 각 호의 1에 해당하는 사유가 발생한 경우에는 회원의 서비스 이용을 제한하거나 중지시킬 수 있습니다.

1. 회원이 회사 서비스의 운영을 고의 또는 중과실로 방해하는 경우

2. 서비스용 설비 점검, 보수 또는 공사로 인하여 부득이한 경우

3. 전기통신사업법에 규정된 기간통신사업자가 전기통신 서비스를 중지했을 경우

4. 국가비상사태, 서비스 설비의 장애 또는 서비스 이용의 폭주 등으로 서비스 이용에 지장이 있는 때

5. 기타 중대한 사유로 인하여 회사가 서비스 제공을 지속하는 것이 부적당하다고 인정하는 경우

② 회사는 전항의 규정에 의하여 서비스의 이용을 제한하거나 중지한 때에는 그 사유 및 제한기간 등을 회원에게 알려야 합니다.

제 8 조 (개인위치정보의 이용 또는 제공)

① 회사는 개인위치정보를 이용하여 서비스를 제공하고자 하는 경우에는 미리 이용약관에 명시한 후 개인위치정보주체의 동의를 얻어야 합니다.

② 회원 및 법정대리인의 권리와 그 행사방법은 제소 당시의 이용자의 주소에 의하며, 주소가 없는 경우에는 거소를 관할하는 지방법원의 전속관할로 합니다. 다만, 제소 당시 이용자의 주소 또는 거소가 분명하지 않거나 외국 거주자의 경우에는 민사소송법상의 관할법원에 제기합니다.

③ 회사는 타사업자 또는 이용 고객과의 요금정산 및 민원처리를 위해 위치정보 이용·제공, 사실 확인자료를 자동 기록·보존하며, 해당 자료는 1년간 보관합니다.

④ 회사는 개인위치정보를 회원이 지정하는 제3자에게 제공하는 경우에는 개인위치정보를 수집한 당해 통신 단말장치로 매회 회원 에게 제공받는 자, 제공 일시 및 제공목적을 즉시 통보합니다. 단, 아래 각 호의 1에 해당하는 경우에는 회원이 미리 특정하여 지정한 통신 단말장치 또는 전자우편주소로 통보합니다.

1. 개인위치정보를 수집한 당해 통신단말장치가 문자, 음성 또는 영상의 수신기능을 갖추지 아니한 경우

2. 회원이 온라인 게시 등의 방법으로 통보할 것을 미리 요청한 경우

제 9 조 (개인위치정보주체의 권리)

① 회원은 회사에 대하여 언제든지 개인위치정보를 이용한 위치기반서비스 제공 및 개인위치정보의 제3자 제공에 대한 동의의 전부 또는 일부를 철회할 수 있습니다. 이 경우 회사는 수집한 개인위치정보 및 위치정보 이용, 제공사실 확인자료를 파기합니다.

② 회원은 회사에 대하여 언제든지 개인위치정보의 수집, 이용 또는 제공의 일시적인 중지를 요구할 수 있으며, 회사는 이를 거절할 수 없고 이를 위한 기술적 수단을 갖추고 있습니다.

③ 회원은 회사에 대하여 아래 각 호의 자료에 대한 열람 또는 고지를 요구할 수 있고, 당해 자료에 오류가 있는 경우에는 그 정정을 요구할 수 있습니다. 이 경우 회사는 정당한 사유 없이 회원의 요구를 거절할 수 없습니다.

1. 본인에 대한 위치정보 수집, 이용, 제공사실 확인자료

2. 본인의 개인위치정보가 위치정보의 보호 및 이용 등에 관한 법률 또는 다른 법률 규정에 의하여 제3자에게 제공된 이유 및 내용

④ 회원은 제1항 내지 제3항의 권리행사를 위해 회사의 소정의 절차를 통해 요구할 수 있습니다.

제 10 조 (법정대리인의 권리)

① 회사는 14세 미만의 회원에 대해서는 개인위치정보를 이용한 위치기반서비스 제공 및 개인위치정보의 제3자 제공에 대한 동의를 당해 회원과 당해 회원의 법정대리인으로부터 동의를 받아야 합니다. 이 경우 법정대리인은 제9조에 의한 회원의 권리를 모두 가집니다.

② 회사는 14세 미만의 아동의 개인위치정보 또는 위치정보 이용, 제공사실 확인자료를 이용약관에 명시 또는 고지한 범위를 넘어 이용하거나 제3자에게 제공하고자 하는 경우에는 14세 미만의 아동과 그 법정대리인의 동의를 받아야 합니다. 단, 아래의 경우는 제외합니다.

1. 위치정보 및 위치기반서비스 제공에 따른 요금정산을 위하여 위치정보 이용, 제공사실 확인자료가 필요한 경우

2. 통계작성, 학술연구 또는 시장조사를 위하여 특정 개인을 알아볼 수 없는 형태로 가공하여 제공하는 경우

제 11 조 (8세 이하의 아동 등의 보호의무자의 권리)

① 회사는 아래의 경우에 해당하는 자(이하 “8세 이하의 아동”등이라 한다)의 보호의무자가 8세 이하의 아동 등의 생명 또는 신체보호를 위하여 개인위치정보의 이용 또는 제공에 동의하는 경우에는 본인의 동의가 있는 것으로 봅니다.

1. 8세 이하의 아동

2. 금치산자

3. 장애인복지법제2조제2항제2호의 규정에 의한 정신적 장애를 가진 자로서 장애인고용촉진및직업재활법 제2조제2호의 규정에 의한 중증장애인에 해당하는 자(장애인복지법 제29조의 규정에 의하여 장애인등록을 한 자에 한한다)

② 8세 이하의 아동 등의 생명 또는 신체의 보호를 위하여 개인위치정보의 이용 또는 제공에 동의를 하고자 하는 보호의무자는 서면동의서에 보호의무자임을 증명하는 서면을 첨부하여 회사에 제출하여야 합니다.

③ 보호의무자는 8세 이하의 아동 등의 개인위치정보 이용 또는 제공에 동의하는 경우 개인위치정보주체 권리의 전부를 행사할 수 있습니다.

제 12조 (위치정보관리책임자의 지정)

① 회사는 위치정보를 적절히 관리·보호하고 개인위치정보주체의 불만을 원활히 처리할 수 있도록 실질적인 책임을 질 수 있는 지위에 있는 자를 위치정보관리책임자로 지정해 운영합니다.

② 위치정보관리책임자는 위치기반서비스를 제공하는 부서의 부서장으로서 구체적인 사항은 본 약관의 부칙에 따릅니다.

제 13 조 (손해배상)

① 회사가 위치정보의 보호 및 이용 등에 관한 법률 제15조 내지 제26조의 규정을 위반한 행위로 회원에게 손해가 발생한 경우 회원은 회사에 대하여 손해배상 청구를 할 수 있습니다. 이 경우 회사는 고의, 과실이 없음을 입증하지 못하는 경우 책임을 면할 수 없습니다.

② 회원이 본 약관의 규정을 위반하여 회사에 손해가 발생한 경우 회사는 회원에 대하여 손해배상을 청구할 수 있습니다. 이 경우 회원은 고의, 과실이 없음을 입증하지 못하는 경우 책임을 면할 수 없습니다.

제 14 조 (면책)

① 회사는 다음 각 호의 경우로 서비스를 제공할 수 없는 경우 이로 인하여 회원에게 발생한 손해에 대해서는 책임을 부담하지 않습니다.

1. 천재지변 또는 이에 준하는 불가항력의 상태가 있는 경우

2. 서비스 제공을 위하여 회사와 서비스 제휴계약을 체결한 제3자의 고의적인 서비스 방해가 있는 경우

3. 회원의 귀책사유로 서비스 이용에 장애가 있는 경우

4. 제1호 내지 제3호를 제외한 기타 회사의 고의ㆍ과실이 없는 사유로 인한 경우

② 회사는 서비스 및 서비스에 게재된 정보, 자료, 사실의 신뢰도, 정확성 등에 대해서는 보증을 하지 않으며 이로 인해 발생한 회원의 손해에 대하여는 책임을 부담하지 아니합니다.

제 15 조 (규정의 준용)

① 본 약관은 대한민국법령에 의하여 규정되고 이행됩니다.

② 본 약관에 규정되지 않은 사항에 대해서는 관련법령 및 상관습에 의합니다.

제 16 조 (분쟁의 조정 및 기타)

① 회사는 위치정보와 관련된 분쟁에 대해 당사자간 협의가 이루어지지 아니하거나 협의를 할 수 없는 경우에는 위치정보의 보호 및 이용 등에 관한 법률 제28조의 규정에 의한 방송통신위원회에 재정을 신청할 수 있습니다.

② 회사 또는 고객은 위치정보와 관련된 분쟁에 대해 당사자간 협의가 이루어지지 아니하거나 협의를 할 수 없는 경우에는 개인정보보호법 제43조의 규정에 의한 개인정보분쟁조정위원회에 조정을 신청할 수 있습니다.

제 17 조 (회사의 연락처) 회사의 상호 및 주소 등은 다음과 같습니다.

1. 상호 : 맵투게더

2. 대표자 : 홍정욱

3. 이메일: official.mapto@gmail.com

4. 대표전화 : +82 10-6331-4287

부 칙

제1조 (시행일) 이 약관은 2022년 7월 7일 부터 시행합니다.

제2조 위치정보관리책임자는 2022년 7월 7일을 기준으로 다음과 같이 지정합니다.

1. 소속 : 맵투게더

2. 이름: 홍정욱

3. 연락처 : +82 10-6331-4287

  '''
);



class TermsAndPolicy {
  final String content;
  const TermsAndPolicy({required this.content});
}